## Python-8. Очистка данных

## 8.2 Букмекерская контора

In [18]:
import pandas as pd
from IPython.display import display

log = pd.read_csv('./file/log.csv',header=None)

display(log.head(1))

                                  0                     1   2   3
0  Запись пользователя № - user_919  [2019-01-01 14:06:51 NaN NaN

### read_csv - Параметры
### Параметры
### header=None - Загрузить без строки с заголовком
### skiprows=n - пропустить n строк
### na_values - список значений, который нужно заменить на NaN

## 8.5 Колонки

In [55]:
column = pd.read_csv('./file/sample.csv',na_values=0)
display(column.columns)
column.columns = ['name','city','age','profession']
display(column.columns)
display(column)

log.columns = ['user_id','time','bet','win']
display(log.head(1))

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

Index(['name', 'city', 'age', 'profession'], dtype='object')

            name         city  age profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN

In [20]:
users = pd.read_csv('./file/users.csv',sep='\t',encoding='koi8_r')
users.columns = ['user_id','email','geo']

display(users.head())

    user_id                email        geo
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

## 8.7 Очистка данных

In [21]:
#display(column.info())
#display(log.user_id.unique())

## 8.8 Простая фильтрация

In [22]:
#display(log[log.user_id != '#error'])
display(log[log.win > 0].head())
display(log[log.win > 0].win.count())

,user_id,time,bet,win
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0

138

## 8.9 Функция query

In [23]:
display(log.query('bet < 2000 & win > 0'))

                              user_id                  time     bet     win
151  Запись пользователя № - user_982  [2019-01-16 21:54:22   100.0  4749.0
189  Запись пользователя № - user_964  [2019-01-21 18:34:44   200.0  4667.0
205  Запись пользователя № - user_931   [2019-01-22 5:26:59   300.0  4319.0
232  Запись пользователя № - user_998   [2019-01-25 8:57:20   500.0  5069.0
265  Запись пользователя № - user_998  [2019-01-29 10:37:55   500.0  6294.0
..                                ...                   ...     ...     ...
962  Запись пользователя № - user_976  [2019-04-19 14:18:45   400.0  5997.0
965  Запись пользователя № - user_900  [2019-04-19 19:31:48   900.0  6767.0
967  Запись пользователя № - user_975  [2019-04-19 22:25:15  1000.0  6108.0
981                            #error                   NaN   800.0  7035.0
991  Запись пользователя № - user_965  [2019-04-20 12:55:41   800.0  6927.0

[113 rows x 4 columns]

## 8.10 Функция str.match и srt.contains

**str.match('abc')** - ищет строки, которые начинаются с abc  
**srt.contain('abc')** - ищет строки, в которых есть abc

In [24]:
log_new = log[~log.user_id.str.match("#error")]
display(log_new)
display(log.user_id.str.match("#error"))

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996     True
997     True
998     True
999     True
Name: user_id, Length: 1000, dtype: bool

8.11 Преобразование данных
--------
**функция apply** - df.column_name.apply(func) - func - лямбда-функции, обычные именные функции def

In [25]:
#display(column.age.apply(lambda x:x**2))

def func(x):
    if x < 20:
        return x
    else:
        return 0

column.age.update(column['age'].apply(lambda y:y+1))
#display(column)

column.city.update(column.city.apply(lambda word:str(word).lower()))
#display(column)

## Задание 3

In [26]:
def profession_code(s):
    if s == "Рабочий":
        return 0
    if s == "Менеджер":
        return 1

    return 2

## Задание 4

In [33]:
column = pd.read_csv('./file/sample.csv')
column.columns = ['name','city','age','profession']
column.profession = column.profession.apply(profession_code)
#column.profession.update(column.profession.apply(profession_code))
column2 = column
display(column2)

            name         city  age  profession
0         Иванов       Москва   25           2
1            NaN    Волгоград   31           1
2         Иванов       Москва   25           2
3        sidorov  Владивосток   43           1
4        _______        Курск   50           2
5       Кузнецов         Сочи   19           0
6          Сажин       Сургут   29           0
7   Котлеревский   Йошкар-Ола   32           0
8     Завалишина    Чебоксары   36           1
9         Левина          NaN   55           0
10          Фикс         Рига   42           0

## Задание 5

In [28]:
def age_category(age):
    if age < 23:
        return "молодой"
    if age >=23 and age <=35:
        return "средний"
    if age > 35:
        return "зрелый"

## Задание 6

In [29]:
column['age_category'] = column.age.apply(age_category)
display(column)

            name         city  age profession age_category
0         Иванов       Москва   25          2      средний
1            NaN    Волгоград   31          1      средний
2         Иванов       Москва   25          2      средний
3        sidorov  Владивосток   43          1       зрелый
4        _______        Курск   50          2       зрелый
5       Кузнецов         Сочи   19          0      молодой
6          Сажин       Сургут   29          0      средний
7   Котлеревский   Йошкар-Ола   32          0      средний
8     Завалишина    Чебоксары   36          1       зрелый
9         Левина          NaN   55          0       зрелый
10          Фикс         Рига   42          0       зрелый

## Задание 7

In [30]:
def replaceUserId(user_id):
    if user_id == "#error":
        return ''
    else:
        return user_id.replace('Запись пользователя № - ','')

log.user_id.update(log.user_id.apply(replaceUserId))
display(log)

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]

## Задание 8

In [31]:
t = log.time[0].replace('[','')
display(t)

'2019-01-01 14:06:51'

## Задание 9

In [37]:
def editColumnTime(time):
    return str(time).replace('[','')

#log.time = log.time.apply(lambda edit:str(edit).replace('[',''))
log.time = log.time.str.replace('[','')
display(log)

C:\Users\MURT~1.SOF\AppData\Local\Temp/ipykernel_13700/1526160266.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  log.time = log.time.str.replace('[','')

      user_id                 time      bet      win
0    user_919  2019-01-01 14:06:51      NaN      NaN
1    user_973  2019-01-01 14:51:16      NaN      NaN
2    user_903  2019-01-01 16:31:16      NaN      NaN
3    user_954  2019-01-01 17:17:51      NaN      NaN
4    user_954  2019-01-01 21:31:18      NaN      NaN
..        ...                  ...      ...      ...
995  user_984   2019-04-20 9:59:58   9754.0      NaN
996                            nan  10054.0  29265.0
997                            nan  10454.0      NaN
998                            nan   1000.0      NaN
999                            nan  10754.0      NaN

[1000 rows x 4 columns]

## 8.12 Финальное задание
### Первое решение

In [ ]:
log = pd.read_csv('./file/log.csv')
log.columns = ['user_id','time','bet','win']
log = log.drop(list(log[log.user_id == '#error'].index))
log.user_id.update(log.user_id.apply(lambda edit:str(edit).replace('Запись пользователя № - ','')))
log.time.update(log.time.apply(lambda edit:str(edit).replace('[','')))
display(log)

      user_id                 time       bet     win
0    user_973  2019-01-01 14:51:16       NaN     NaN
1    user_903  2019-01-01 16:31:16       NaN     NaN
2    user_954  2019-01-01 17:17:51       NaN     NaN
3    user_954  2019-01-01 21:31:18       NaN     NaN
4    user_917  2019-01-01 23:34:55  156789.0     NaN
..        ...                  ...       ...     ...
990  user_965  2019-04-20 12:55:41     800.0  6927.0
991  user_967  2019-04-20 14:59:36   10154.0     NaN
992  user_973  2019-04-20 17:09:56   10254.0     NaN
993  user_977  2019-04-20 18:10:07   10354.0     NaN
994  user_984   2019-04-20 9:59:58    9754.0     NaN

[984 rows x 4 columns]

### Второе решение

In [17]:
log = pd.read_csv('./file/log.csv')
log.columns = ['user_id','time','bet','win']
#log = log[~log.user_id.str.match('#error')]
#log[~log.user_id.str.match('#error')]
log = log.drop(list(log[log.user_id == '#error'].index))
#log.user_id = log.user_id.str.replace('Запись пользователя № - ','')
#log.time = log.time.str.replace('[','')
log.user_id.update(log.user_id.apply(lambda edit:str(edit).replace('Запись пользователя № - ','')))
log.time.update(log.time.apply(lambda edit:str(edit).replace('[','')))
display(log)

      user_id                 time       bet     win
0    user_973  2019-01-01 14:51:16       NaN     NaN
1    user_903  2019-01-01 16:31:16       NaN     NaN
2    user_954  2019-01-01 17:17:51       NaN     NaN
3    user_954  2019-01-01 21:31:18       NaN     NaN
4    user_917  2019-01-01 23:34:55  156789.0     NaN
..        ...                  ...       ...     ...
990  user_965  2019-04-20 12:55:41     800.0  6927.0
991  user_967  2019-04-20 14:59:36   10154.0     NaN
992  user_973  2019-04-20 17:09:56   10254.0     NaN
993  user_977  2019-04-20 18:10:07   10354.0     NaN
994  user_984   2019-04-20 9:59:58    9754.0     NaN

[984 rows x 4 columns]

### Третье решение

In [62]:
log = pd.read_csv('./file/log.csv',header=None)
log.columns = ['user_id','time','bet','win']
log = log[~log.user_id.str.match('#error',na=False)]
def user_id_replace(user_id):
    return user_id.replace('Запись пользователя № - ','')
log.user_id = log.user_id.apply(user_id_replace)
log.time = log.time.str.replace('[','')

display(log)

C:\Users\MURT~1.SOF\AppData\Local\Temp/ipykernel_13700/1054377036.py:7: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  log.time = log.time.str.replace('[','')

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]